README.org
#+TITLE: Chithresh's Emacs Config
#+AUTHOR: Chithresh
#+STARTUP: content

* UI Tweaks
** Decluttering the UI
#+begin_src emacs-lisp
  (setq inhibit-startup-message t            ; Don't show the splash screen
        use-short-answers t                  ; Use y or n instead of yes or no
        visible-bell t)                      ; Flash Screen instead of Audible Bell

  (menu-bar-mode -1)                         ; Hide Menu Bar
  (tool-bar-mode -1)                         ; Hide Tool Bar
  (scroll-bar-mode -1)                       ; Hide Scroll Bar
  (fringe-mode 10)                           ; Add some Space to the Left & Right Border
  (setq display-line-numbers-width 4)        ; Set the width for line numbers
  (setq display-line-numbers-width-start t)  ; Ensure it adjusts only once at startup
#+end_src

** Line & Column Numbers
#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1)        ; Enable Line Numbers
  (setq display-line-numbers-type 'relative)  ; Relative Line Numbers (or Visual)
  (setq column-number-mode t)                 ; Set Column Numbers
#+end_src

* Package Manager Setup
** Elpaca
#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

** Use-Package Support for Elpaca
#+begin_src emacs-lisp
  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode))

  ;; Install all Packages instead of :ensure t for Every Package
  ;; Specifiy :ensure nil for Packages which should not be Installed Automatically (or for Built-in Packages)
  (setq use-package-always-ensure t)
#+end_src

* Modus Theme
#+begin_src emacs-lisp
  (setq modus-themes-mode-line '(accented borderless)
        modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-fringes 'subtle
        modus-themes-tabs-accented t
        modus-themes-paren-match '(bold intense)
        modus-themes-prompts '(bold intense)
        modus-themes-org-blocks 'tinted-background
        modus-themes-scale-headings t
        modus-themes-region '(bg-only))

  ;; Load the dark theme by default
  (load-theme 'modus-vivendi-tinted t)
#+end_src

* Packages and Config
** Evil Mode
#+begin_src emacs-lisp
  (use-package evil
    :demand t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-undo-system 'undo-redo)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    :config
    (evil-mode 1))
#+end_src

** Evil Collection
#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :custom
    (evil-collection-setup-minibuffer t)  ; Enable Evil Mode in MiniBuffer
    :config
    (evil-collection-init))
#+end_src

** Dired
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil  ; Built-in
    :defer t
    :hook
      (dired-mode . dired-hide-details-mode))
    :config
      (setq dired-listing-switches "-aBhl  --group-directories-first")
      (setq dired-kill-when-opening-new-dired-buffer t)  ; Open all Directories in the Same Dired Buffer
#+end_src

** SHELL
Config for M-x Shell
#+begin_src emacs-lisp
  (setq explicit-shell-file-name "/usr/bin/bash")
  (setq comint-prompt-read-only t)  ; Make Shell Prompt Read Only
#+end_src

** Tramp
#+begin_src emacs-lisp
    (connection-local-set-profile-variables 'remote-bash
       '((shell-file-name . "/usr/bin/bash")
         (shell-command-switch . "-lc")  ; -l is required to load ENV variables & PATH
         (shell-interactive-switch . "-i")
         (shell-login-switch . "-l")))
    (connection-local-set-profiles
       '(:application tramp) 'remote-bash) ; set bash as default shell for all tramp connections
#+end_src

** Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure nil  ; Built-in
    :config
    (which-key-mode))
#+end_src

** Engraved Faces
For properly formatting code blocks in org-mode latex export
#+begin_src emacs-lisp
  (use-package engrave-faces)
#+end_src

** Modeline Bell
Blinking the Modeline instead of Visual Bell
#+begin_src emacs-lisp
  (use-package mode-line-bell
    :custom
    (mode-line-bell-mode t))
#+end_src

* Org Mode
** Org Babel
#+begin_src emacs-lisp
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((python . t)))
#+end_src

** Org Latex
#+begin_src emacs-lisp
  (setq org-latex-src-block-backend 'engraved)     ; Set src block formatting backend to Engraved
  ;;(setq org-latex-engraved-theme 'doom-one-light)  ; Set doom-one-light theme for Latex Code Block Export
#+end_src

* Keybindings
** Window Management
#+begin_src emacs-lisp
  ;; Window Management
  ;; (global-set-key (kbd "<C-up>") 'shrink-window)
  ;; (global-set-key (kbd "<C-down>") 'enlarge-window)
  ;; (global-set-key (kbd "<C-left>") 'shrink-window-horizontally)
  ;; (global-set-key (kbd "<C-right>") 'enlarge-window-horizontally)
#+end_src

** Global Keybinds
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)  ; ESC quits Prompts (Partially Works)
#+end_src
